SWITCH
enable or en
show mac address-table
configure terminal or conf ter
(config)hostname Switch7 - add name of switch
  
(config)interface vlan 1 or (config)int vlan 1
(config-if)ip address 192.168.1.100 255.255.255.0
(config-if)no shutdown or (config-if)no sh
(config)#username user password Qq123456
(config)#aaa new-model
write or wr or do write or do wr
exit

ROUTER
en
conf ter
(config)#int e0/1
(config-if)#ip address 192.168.1.1 255.255.255.0
(config-if)#no shutdown
do wr

Смотрим сюда 8zML2GV.png

Помещаем в Vlan 10
Switch 7
en
conf ter
(config)#int e1/2
(config-if)#switchport mode access
(config-if)#switchport access vlan 10
конфигурируем trunk port
(config)#int e0/0
(config-if)#switchport trunk encapsulation dot1q
(config-if)#switchport mode trunk

Настройка связей между сетями
Router>en
Router#conf t
Router(config)#hostname R4-2
R4-2(config)#int e0/1
R4-2(config-if)#no shutdown
R4-2(config-if)#ip addr 10.4.3.2 255.255.255.252
R4-2(config-if)#int e0/0
R4-2(config-if)#no shutdown
R4-2(config-if)#ip addr 10.4.2.1 255.255.255.252

Настройка маршрутизации
Основной командой, для настройки статической маршрутизации является:

Router(config)#ip route <distanation-network> <mask> <next-hop>

distanation-network - IP-адрес, до которой прописывается маршрут.
mask - маска хоста или подсети, до которой прописывается маршрут.
next-hop - IP-адрес шлюза, через который прописывается маршрут
Для примера пропишем маршрут от сети 10.4.3.0 до 10.3.3.0.
Перейдем на роутер R4-2. Воспользовавшись командой выше. Получим:

Router>en
Router#conf ter
Router(config)#ip route 10.3.3.0 255.255.255.252 10.4.2.2

Здесь мы говорим роутеру R4-2, что если на него придет пакет с ip адресом назначения из сети 10.3.3.0 переслать его на ip адрес роутера R4-1, который далее смаршрутизирует его до конечного хоста.

Теперь роутеру R4-1 нужно сообщить, как дойти до сети 10.3.3.0. И аналогично для всех маршрутизатор на всем пути от сети 10.4.3.0 до 10.3.3.0.

R4-1

R4-1(config)#ip route 10.3.3.0 255.255.255.252 10.4.1.2

Main_Router

Main_Router(config)#ip route 10.3.3.0 255.255.255.252 10.3.1.1

R3-1

R3-1(config)#ip route 10.3.3.0 255.255.255.252 10.3.2.1

На этом настройка маршрута от сети 10.4.3.0 до 10.3.3.0.

Примечание! На роутере R3-2 не нужно прописывать маршрут до сети 10.3.3.0, так как напрямую подключена к его интерфейсу.

Если мы сейчас попробуем пропинговать компьютер из сети 10.3.3.0 из сети 10.4.3.0 мы обнаружим, что пакеты не доходят обратно. Все потому, что роутер R4-2 знает маршрут до сети 10.3.3.0, но роутер R3-2 не знает маршрут до сети 10.4.3.0, из-за чего ICMP пакеты не будет прийти обратно.

Настроим маршрут из сети 10.3.3.0 до 10.4.3.0.
R3-2

R3-2(config)#ip route 10.4.3.0 255.255.255.252 10.3.2.2

R3-1

R3-1(config)#ip route 10.4.3.0 255.255.255.252 10.3.1.2

Main_Router

Main_Router(config)#ip route 10.4.3.0 255.255.255.252 10.4.1.1

R4-1

R4-1(config)#ip route 10.4.3.0 255.255.255.252 10.4.2.1

Теперь пакеты должны ходить из сети 10.4.3.0 до 10.3.3.0 и обратно.
Проверка
Дадим ip адрес, маску и шлюз компьютеру VPC31, и попробуем выполнить команду `ping`.

VPCS> ip 10.3.3.1 255.255.255.252 10.3.3.2
VPCS> ping 10.4.3.2

84 bytes from 10.4.3.2 icmp_seq=1 ttl=251 time=1.150 ms
84 bytes from 10.4.3.2 icmp_seq=2 ttl=251 time=1.193 ms
84 bytes from 10.4.3.2 icmp_seq=3 ttl=251 time=1.227 ms
84 bytes from 10.4.3.2 icmp_seq=4 ttl=251 time=1.224 ms

Пинг проходит успешно. Аналогично для остальных сетей.

